package exercises

// 11. Worker Pool с возвратом результата
// Теперь чуть сложнее: нужно не просто обрабатывать задания, но и **возвращать результаты**.
// Задача
// Реализуйте **воркер-пул**, который:
//	- Читает задания из канала (например, числа от 1 до 20).
//	- Обрабатывает их в нескольких горутинах (воркерах).
//	- Возвращает результат обработки (например, квадрат числа).
//	- Собирает **все результаты** и выводит их **в конце выполнения программы**.
//
// <aside>
// Не подсматривай в предыдущий пример. Сделай с нуля по памяти — это важный навык. Подумай, **как организовать возврат результата от каждого воркера** и где его собирать.
// </aside>

func main() {
	// TODO реализация
}
